BigBroBob2/bat_tag_nrf5340dk/src/main.c
            NRF_P0->PIN_CNF[12] = 1;
            NRF_P0->OUTSET |= 1 << 12;

            ICM_readSensor();
             
            imu_t = k_cycle_get_32();
            IMU_data[6] = imu_t >> 16;
            IMU_data[7] = imu_t & 0x0000FFFF;
            IMU_data[8]++; 

            // memcpy(imu_rbuf,&IMU_data[0],sizeof(IMU_data)); 

            // write data into circular buf
            write_in_buf(&imu_circle_buf,IMU_data,9);

            NRF_P0->OUTCLR |= 1 << 12;
    }
}
}

// 2nd SPI ICM thread
static short H_imu_rbuf[9]; // small read buf to get direct data each time IRQ
// static short H_imu_buf[N_circular_buf]; // IMU buffer
static short H_imu_cw_buf[N_circular_buf]; // IMU count write buffer
static int32_t H_imu_t; // timestamp for each IMU writing 
static uint16_t H_ICM_count = 0; // sample count within the buffer, be really careful with uint8_t and int8_t
// static uint16_t H_ICM_cw=0;

struct k_thread H_ICM_thread_data;
/*ICM processing thread*/
#define H_ICM_THREAD_STACK_SIZE 1024
/* ICM thread is a priority cooperative thread, less than PDM mic*/
#define H_ICM_THREAD_PRIORITY -16
K_THREAD_STACK_DEFINE(H_ICM_thread_stack_area, H_ICM_THREAD_STACK_SIZE);
K_SEM_DEFINE(H_ICM_thread_semaphore, 0, 1);

static void H_ICM_thread_entry_point(void *p1, void *p2, void *p3) {
    while (true) {
        if (k_sem_take(&H_ICM_thread_semaphore, K_FOREVER) == 0) {
            

            H_ICM_readSensor();

            H_imu_t = k_cycle_get_32();
            H_IMU_data[6] = H_imu_t >> 16;
            H_IMU_data[7] = H_imu_t & 0x0000FFFF;
            H_IMU_data[8]++;

            // memcpy(H_imu_rbuf,&H_IMU_data[0],sizeof(H_IMU_data)); 

            // write data into circular buf
            write_in_buf(&H_imu_circle_buf,H_IMU_data,9);

    }
}
}

ISR_DIRECT_DECLARE(ICM_handler)
{   
    // https://github.com/gcmcnutt/HeadTracker/blob/4d5e3fb4793d519110b5812090c64401381d3b56/firmware/src/src/targets/nrf52/PPMIn.cpp#L191
    ISR_DIRECT_HEADER();
    // printk("EVENTS_IN[7]=%d, CONFIG[7].PSEL=0x%x\n",NRF_GPIOTE0->EVENTS_IN[7],NRF_GPIOTE0->CONFIG[7]);
    if (NRF_GPIOTE0->EVENTS_IN[6]) {

            NRF_GPIOTE0->EVENTS_IN[6] = 0;
            k_sem_give(&H_ICM_thread_semaphore);
        
        }
    else if (NRF_GPIOTE0->EVENTS_IN[7]) {
        NRF_GPIOTE0->EVENTS_IN[7] = 0;
            k_sem_give(&ICM_thread_semaphore);
            
        }

    return 0;
}

//////////////////////////////////////////////////////////////////////////////////// I2S PDM mic

/* Flag indicating which buffer pair is currently available for
   processing/rendering. */
static int processing_buffers_1 = 0;

/* Indicates if the current buffer pair is being processed/rendered. */
atomic_t processing_in_progress = ATOMIC_INIT(0x00);
/* Indicates if a dropout occurred, i.e that audio buffers were
   not processed in time for the next buffer swap. */
atomic_t dropout_occurred = ATOMIC_INIT(0x00);

static uint32_t mic_t[1];
static int32_t *rx;


#define BYTES_PER_SAMPLE 4
#define AUDIO_BUFFER_N_SAMPLES 4096
#define AUDIO_BUFFER_BYTE_SIZE (BYTES_PER_SAMPLE * AUDIO_BUFFER_N_SAMPLES)
#define AUDIO_BUFFER_WORD_SIZE (AUDIO_BUFFER_BYTE_SIZE / 4)

/* Use two pairs of rx/tx buffers for double buffering,
   i.e process/render one pair of buffers while the other is
   being received/transfered. */
static int32_t __attribute__((aligned(4))) rx_1[AUDIO_BUFFER_N_SAMPLES];
static int32_t __attribute__((aligned(4))) rx_2[AUDIO_BUFFER_N_SAMPLES];
nrfx_i2s_buffers_t nrfx_i2s_buffers_1 = {
    .p_rx_buffer = (uint32_t *)(&rx_1), .p_tx_buffer = NULL
};
nrfx_i2s_buffers_t nrfx_i2s_buffers_2 = {
    .p_rx_buffer = (uint32_t *)(&rx_2), .p_tx_buffer = NULL
};

// learn I2S thread from https://github.com/stuffmatic/microdsp-zephyr-demos/blob/497e0bb7fc23103827d3e283d5374ed00ea315c7/src/i2s.c#L63
/*Audio processing thread*/
#define PROCESSING_THREAD_STACK_SIZE 2048
/* Processing thread is a top priority cooperative thread */
#define PROCESSING_THREAD_PRIORITY -15
K_THREAD_STACK_DEFINE(processing_thread_stack_area, PROCESSING_THREAD_STACK_SIZE);
K_SEM_DEFINE(processing_thread_semaphore, 0, 1);
struct k_thread processing_thread_data;

K_SEM_DEFINE(SDcard_thread_semaphore, 0, 1);

static void processing_thread_entry_point(void *p1, void *p2, void *p3) {
    while (true) {
        

        if (k_sem_take(&processing_thread_semaphore, K_USEC(1)) == 0) {

            
            NRF_P0->PIN_CNF[31] = 1;
            NRF_P0->OUTSET |= 1 << 31;

            if (atomic_test_bit(&dropout_occurred, 0)) {
                printk("dropout_occurred\n");
                atomic_clear_bit(&dropout_occurred, 0);
            }

            

            if (!atomic_test_bit(&processing_in_progress, 0)) {
                printk("processing_in_progress is not set");
                __ASSERT(atomic_test_bit(&processing_in_progress, 0), "processing_in_progress is not set");
            }

            nrfx_i2s_buffers_t* buffers_to_process = processing_buffers_1 ? &nrfx_i2s_buffers_1 : &nrfx_i2s_buffers_2;
            rx = (int32_t *)buffers_to_process->p_rx_buffer;

            
            ///////////////// somehow mic_data and IMU_data fs_write together can work
            
            /* Swap buffers */
            nrfx_err_t result = nrfx_i2s_next_buffers_set(buffers_to_process);
            if (result != NRFX_SUCCESS) {
                /* printk("nrfx_i2s_next_buffers_set failed with %d\n", result); */
                __ASSERT(result == NRFX_SUCCESS, "nrfx_i2s_next_buffers_set failed with result %d", result);
            }
            processing_buffers_1 = !processing_buffers_1;   
            
            // can use this as timestamp of next audio buffer start time
            // mic_t[0] = k_cycle_get_32();
            // fs_write(&mic_file,&mic_t,sizeof(mic_t));

            // we record IMU and change ICM_count with circular buffer during IMU data writing
            

            // NRFX_IRQ_DISABLE(GPIOTE0_IRQn);
            // NVIC_DisableIRQ(GPIOTE0_IRQn);
            // irq_disable(GPIOTE0_IRQn);
            // NRF_GPIOTE->INTENCLR |= 0x00000080;
                //read out circualr buf
                

            // NRF_GPIOTE->INTENSET |= 0x00000080;
            // NVIC_EnableIRQ(GPIOTE0_IRQn);
            // irq_enable(GPIOTE0_IRQn);
            // NRFX_IRQ_ENABLE(GPIOTE0_IRQn);

 
            k_sem_give(&SDcard_thread_semaphore);
            
        
            NRF_P0->OUTCLR |= 1 << 31;
            
            
            
            
            /* Done audio processing */
            atomic_clear_bit(&processing_in_progress, 0);
        }
        
