BigBroBob2/bat_tag_nrf5340dk/src/main.c
    }
}

ISR_DIRECT_DECLARE(i2s_isr_handler)
{
    nrfx_i2s_irq_handler();
    // ISR_DIRECT_PM();
    return 1;
}

void nrfx_i2s_data_handler(nrfx_i2s_buffers_t const *p_released, uint32_t status)
{   
    
    if (status == NRFX_I2S_STATUS_NEXT_BUFFERS_NEEDED) {
        if (atomic_test_bit(&processing_in_progress, 0) == false) {
            atomic_set_bit(&processing_in_progress, 0);
            k_sem_give(&processing_thread_semaphore);
        } else {
            /* Missed deadline! */
            atomic_set_bit(&dropout_occurred, 0);
        }
    }
    else if (status == NRFX_I2S_STATUS_TRANSFER_STOPPED) {
        /* */
    }

}



/*
Configure i2s driver using zephyr functions, 
which are kind of convenient and by using them we don't need to set register values and later define RX buffers.

We only care about SCK (bit stream freq) and LRCK is in fact meaningless;
change nrfx_i2s_cfg.mck_setup to choose different MCK freq
*/
static bool configure_i2s_rx(const struct device *i2s_rx_dev)
{	
	int ret;

    IRQ_DIRECT_CONNECT(I2S0_IRQn, 0, i2s_isr_handler, 0);

    nrfx_i2s_config_t nrfx_i2s_cfg = {
        .sck_pin = I2S_SCK,
        .lrck_pin = I2S_LRCK,
        .mck_pin = I2S_MCK,
        .sdin_pin = I2S_SDIN,
        .mck_setup = i2s_mckfreq,
        .ratio = I2S_CONFIG_RATIO_RATIO_32X,
        .irq_priority = NRFX_I2S_DEFAULT_CONFIG_IRQ_PRIORITY,
        .mode = NRF_I2S_MODE_MASTER,
        .format = NRF_I2S_FORMAT_I2S,
        .alignment = NRF_I2S_ALIGN_LEFT,
        .channels = NRF_I2S_CHANNELS_STEREO,
        .sample_width = NRF_I2S_SWIDTH_32BIT
    };
    
    nrfx_err_t result = nrfx_i2s_init(&nrfx_i2s_cfg, &nrfx_i2s_data_handler);
    if (result != NRFX_SUCCESS) {
        printk("nrfx_i2s_init failed with result %d\n", result);
        __ASSERT(result == NRFX_SUCCESS, "nrfx_i2s_init failed with result %d", result);
        return result;
    }


	if (ret < 0) {
		printk("Failed to configure i2s rx: %d\n", ret);
		return false;
	}

	return true;
}

//////////////////////////////////////////////////////////////////////////////// thread for writing into SD card

struct k_thread SDcard_thread_data;
#define SDcard_THREAD_STACK_SIZE 1024
#define SDcard_THREAD_PRIORITY -14
K_THREAD_STACK_DEFINE(SDcard_thread_stack_area, SDcard_THREAD_STACK_SIZE);


static void SDcard_thread_entry_point(void *p1, void *p2, void *p3) {
    while (true) {
        if (k_sem_take(&SDcard_thread_semaphore, K_FOREVER) == 0) {
            // audio
            fs_write(&mic_file,&rx[0],AUDIO_BUFFER_BYTE_SIZE);
        
            // camera
            frame_block_read_out_buf(&camera_circle_buf,camera_buf, &camera_count);
            // printk("camera_count=%d\n",camera_count);
		    fs_write(&video_file, &camera_buf,camera_count*frame_block_size);

            // IMU 
            read_out_buf(&imu_circle_buf,imu_buf,&ICM_count);
            fs_write(&imu_file, &imu_buf,ICM_count*sizeof(short));
            read_out_buf(&H_imu_circle_buf,imu_buf,&H_ICM_count);
            fs_write(&H_imu_file, &imu_buf,H_ICM_count*sizeof(short));
    }
}
}

struct k_work_delayable bl5340_vregh_reset_delayed_work;
/** @brief Delayed work handler used to trigger a reset when VREGHVOUT changes.
 *
 *  @param [in]item - Delayed work item data.
 */
static void bl5340_vregh_reset_handler(struct k_work *item)
{
	/* Now reset to allow changes to take effect */
	sys_reboot(SYS_REBOOT_WARM);
}

void main(void)
{   
    int error;

    ////// set high-voltage regulator to convert VDDH=4.2V to VDD=3.7V 
    /* Block writes if the register is already set */
	if ((NRF_UICR->VREGHVOUT) != UICR_VREGHVOUT_VREGHVOUT_3V3) {
    /* Enable writes to the UICR */
	NRF_NVMC->CONFIG = NVMC_CONFIG_WEN_Wen
			   << NVMC_CONFIG_WEN_Pos;
	while (NRF_NVMC->READY == NVMC_READY_READY_Busy) {
	}
	/* Now go ahead and apply the voltage */
	NRF_UICR->VREGHVOUT = UICR_VREGHVOUT_VREGHVOUT_3V3;
	/* And finalise the write */
	NRF_NVMC->CONFIG = NVMC_CONFIG_WEN_Ren
			   << NVMC_CONFIG_WEN_Pos;
	while (NRF_NVMC->READY == NVMC_READY_READY_Busy) {
	}
    k_work_init_delayable(
					&bl5340_vregh_reset_delayed_work,
					bl5340_vregh_reset_handler);
	/* Then trigger it */
	k_work_schedule(
					&bl5340_vregh_reset_delayed_work,
					K_MSEC(1000));
    }
	/* Read back to validate */
	printk("NRF_REGULATORS->MAINREGSTATUS=0x%x, NRF_UICR->VREGHVOUT=0x%x\n", NRF_REGULATORS->MAINREGSTATUS, NRF_UICR->VREGHVOUT);     

    // NRF_REGULATORS->MAINREGSTATUS = REGULATORS_MAINREGSTATUS_VREGH_Active;
    

    //////////////////////////// SD card
	
    setup_disk();

    k_msleep(1000);

    trial_count = lsdir(disk_mount_pt);

    //////////////////////////////////////////////// bluetooth uart 
    error = bt_enable(NULL);
	if (error) {
		printk("Bluetooth initialize error\n");
	}

    k_sem_give(&ble_init_ok);

    settings_load();

    error = bt_nus_init(&nus_cb);
	if (error) {
		printk("Failed to initialize UART service (error: %d)\n", error);
		return 0;
	}

    // start advertising
    error = bt_le_adv_start(BT_LE_ADV_CONN, ad, ARRAY_SIZE(ad), sd,
			      ARRAY_SIZE(sd));
	if (error) {
		printk("Advertising failed to start (error %d)\n", error);
		return 0;
	}


    //////////////// Init NanEyeC camera
    NRF_P0->PIN_CNF[SCLK_pin] = 0;
	NRF_P0->PIN_CNF[SDAT_pin] = 0;
    InitSPI();
	NanEye_InitialConfig();
    ReSYNC();	

    k_tid_t image_processing_thread_tid = k_thread_create(
        &image_processing_thread_data,
        image_processing_thread_stack_area,
        K_THREAD_STACK_SIZEOF(image_processing_thread_stack_area),
        image_processing_thread_entry_point,
        NULL, NULL, NULL,
        image_processing_THREAD_PRIORITY, 0, K_NO_WAIT
    );

    /////////// start SD card thread
    k_tid_t SDcard_thread_tid = k_thread_create(
        &SDcard_thread_data,
        SDcard_thread_stack_area,
        K_THREAD_STACK_SIZEOF(SDcard_thread_stack_area),
        SDcard_thread_entry_point,
        NULL, NULL, NULL,
        SDcard_THREAD_PRIORITY, 0, K_NO_WAIT
    );

