BigBroBob2/bat_tag_nrf5340dk/src/main.c
    ////////////////// wait for bluetooth connection
    while (!current_conn) {
        printk("Wait for bluetooth connection..\n");
        k_msleep(1000);
    } 
    // connected

    ///////////////////////////////////////// Here starts multiple trial loop
    while (current_conn) {
    while(!trial_start && current_conn) {
        printk("Trial %02d, Wait for command..\n", trial_count);
        k_msleep(1000);
    }

    // Somehow this is not working, probably only 4 files at the same time
    // Write configuration into a file
    // struct fs_file_t cfg_file;
    // char filename[30];
    // char str_buf[50];
    // fs_file_t_init(&cfg_file);
    // printk("Opening cfg_file path\n");
	// sprintf(&filename, "/SD:/config_%02d.dat", trial_count); 
    // fs_unlink(filename);
	// error = fs_open(&cfg_file, filename, FS_O_CREATE | FS_O_WRITE);
    // sprintf(&str_buf, "imu_fs=0x%02x, mic_fs=0x%08x\n", rate_idx, i2s_mckfreq);
    // fs_write(&cfg_file,&str_buf,sizeof(str_buf));
    // fs_close(&cfg_file);

    // k_msleep(1000);
    // lsdir(disk_mount_pt);
    // k_msleep(1000);
    
    
    // define data files
    define_files();

    //////////////////////////////////////////////// SPI for second IMU

    // check ICM binding
    if (!spi_dev1) {
        printk("spi_dev1 Binding failed.");
        return;
    }

    printk("Value of NRF_SPIM1->PSEL.SCK : %d \n",NRF_SPIM1->PSEL.SCK);
    printk("Value of NRF_SPIM1->PSEL.MOSI : %d \n",NRF_SPIM1->PSEL.MOSI);
    printk("Value of NRF_SPIM1->PSEL.MISO : %d \n",NRF_SPIM1->PSEL.MISO);

    /// config SPI first
    H_ICM_SPI_config();

    // set ICM samping rate
    H_ICM_setSamplingRate(rate_idx);

    // enable interrupt
    H_ICM_enableINT();

    // enable sensor
    H_ICM_enableSensor();

    

    

    ////////////////////////////////////////////  SPI devices IMU

    

    // check ICM binding
    if (!spi_dev2) {
        printk("spi_dev2 Binding failed.");
        return;
    }
    printk("Value of NRF_SPIM2->PSEL.SCK : %d \n",NRF_SPIM2->PSEL.SCK);
    printk("Value of NRF_SPIM2->PSEL.MOSI : %d \n",NRF_SPIM2->PSEL.MOSI);
    printk("Value of NRF_SPIM2->PSEL.MISO : %d \n",NRF_SPIM2->PSEL.MISO);
    // printk("Value of NRF_SPIM2 frequency : %d \n",NRF_SPIM2->FREQUENCY);

    
    /// config SPI first
    ICM_SPI_config();
    
    // set ICM samping rate
    ICM_setSamplingRate(rate_idx);

    // enable interrupt
    ICM_enableINT();

    // enable sensor
    ICM_enableSensor();

    
    
    // while(1) {

    //     H_ICM_readSensor();
    //     printk("%d, %d, %d, ", H_IMU_data[0],H_IMU_data[1],H_IMU_data[2]);

    //     ICM_readSensor();
    //     printk("%d, %d, %d \n", IMU_data[0],IMU_data[1],IMU_data[2]);
        
    //     k_msleep(500);
    // }

    // GPIO configure interrupt
    // gpio_pin_interrupt_configure(GPIO_dev,ICM_INT_pin,GPIO_INT_EDGE_RISING);
    // gpio_init_callback(&ICM_INT_cb,ICM_INT_handler,BIT(ICM_INT_pin));
    // GPIOTE0 for secure
    IRQ_DIRECT_CONNECT(GPIOTE0_IRQn, 0, ICM_handler, 0);

    


    // try give semaphore as IMU interrupt
    // Event mode, P0.30 for interrupt, when rising edge
    // check NRF_GPIOTE->EVENTS_IN[0]
    nrf_gpiote_event_configure(NRF_GPIOTE0,6,30,GPIOTE_CONFIG_POLARITY_LoToHi);

    // try give semaphore as IMU interrupt
    // Event mode, P0.25 for interrupt, when rising edge
    // NRF_GPIOTE->CONFIG[0] = 0x00011901;
    // check NRF_GPIOTE->EVENTS_IN[0]
    nrf_gpiote_event_configure(NRF_GPIOTE0,7,25,GPIOTE_CONFIG_POLARITY_LoToHi);
    

    k_msleep(10);

    //////////////////////////////////////////////// I2S for PDM mic

    const struct device *const i2s_rx_dev = DEVICE_DT_GET(DT_NODELABEL(i2s_rx_dev));

    if (!device_is_ready(i2s_rx_dev)) {
		printk("unable to find i2s_rx device\n");	
	}
    printk("I2S device is ready\n");

     /* Start a dedicated, high priority thread for audio processing. */
    k_tid_t processing_thread_tid = k_thread_create(
        &processing_thread_data,
        processing_thread_stack_area,
        K_THREAD_STACK_SIZEOF(processing_thread_stack_area),
        processing_thread_entry_point,
        NULL, NULL, NULL,
        PROCESSING_THREAD_PRIORITY, 0, K_NO_WAIT
    );

    if (!configure_i2s_rx(i2s_rx_dev)) {
        printk("Failed to config streams\n", i2s_rx_dev->name);
		return 0;
    }
    printk("I2S configured\n");

    // f_actual = f_source / floor(1048576*4096/MCKFREQ)
    printk("NRF I2S0 CONFIG.MCKFREQ = %d, f_actual = %.3f\n", NRF_I2S0->CONFIG.MCKFREQ, 0.00745*NRF_I2S0->CONFIG.MCKFREQ);
   

    


    ///////////////////////////////////////////////////////////////// START SAMPLE

     // thread for SD card
    

    // try to use thread to read ICM data
    k_tid_t ICM_thread_tid = k_thread_create(
        &ICM_thread_data,
        ICM_thread_stack_area,
        K_THREAD_STACK_SIZEOF(ICM_thread_stack_area),
        ICM_thread_entry_point,
        NULL, NULL, NULL,
        ICM_THREAD_PRIORITY, 0, K_NO_WAIT
    );
    // gpio_add_callback(GPIO_dev, &ICM_INT_cb);

    // use another thread to read 2nd ICM data
    k_tid_t H_ICM_thread_tid = k_thread_create(
        &H_ICM_thread_data,
        H_ICM_thread_stack_area,
        K_THREAD_STACK_SIZEOF(H_ICM_thread_stack_area),
        H_ICM_thread_entry_point,
        NULL, NULL, NULL,
        H_ICM_THREAD_PRIORITY, 0, K_NO_WAIT
    );

    // reset cirular buffer idx and processing_buffers
        // Reset variables at the start of each trial
    // imu_count_idx[0]=0;
    imu_circle_buf.read_idx = 0;
    imu_circle_buf.write_idx = 0;
    // count_circle_buf.read_idx = 0;
    // count_circle_buf.write_idx = 0;

    // H_imu_count_idx[0]=0;
    H_imu_circle_buf.read_idx = 0;
    H_imu_circle_buf.write_idx = 0;
    // H_count_circle_buf.read_idx = 0;
    // H_count_circle_buf.write_idx = 0;

    processing_buffers_1 = 0;  

    // clear count
    IMU_data[8] = 0;
    H_IMU_data[8] = 0;

    
    printk("Starting I2S stream..\n");

    // start I2S
    error = nrfx_i2s_start(&nrfx_i2s_buffers_1, AUDIO_BUFFER_WORD_SIZE, 0);
    
    nrf_i2s_int_enable(NRF_I2S0, NRF_I2S_INT_RXPTRUPD_MASK |
                                  NRF_I2S_INT_TXPTRUPD_MASK);

    // enable GPIOTE
    NRF_GPIOTE0->EVENTS_IN[7] = 0;
    NRF_GPIOTE->INTENSET |= 0x00000080;
    NRF_GPIOTE0->EVENTS_IN[6] = 0;
    NRF_GPIOTE->INTENSET |= 0x00000040;
    // enable gpiote event (IMU INT)
    nrf_gpiote_event_enable(NRF_GPIOTE0, 7);
    nrf_gpiote_event_enable(NRF_GPIOTE0, 6);
    // enable GPIOTE IRQ
    NRFX_IRQ_ENABLE(GPIOTE0_IRQn);
    NVIC_EnableIRQ(GPIOTE0_IRQn);
    irq_enable(GPIOTE0_IRQn);



    // start camera
    k_tid_t camera_thread_tid = k_thread_create(
        &camera_thread_data,
        camera_thread_stack_area,
        K_THREAD_STACK_SIZEOF(camera_thread_stack_area),
        camera_thread_entry_point,
        NULL, NULL, NULL,
        camera_THREAD_PRIORITY, 0, K_NO_WAIT
    );
    
    ///////////////////////////////////////// loop
    // while (current_conn) 
    // {   
    //     printk("buf_length_imu=%d, buf_length_H_imu=%d\n",buf_length(&imu_circle_buf),buf_length(&H_imu_circle_buf));
    //     k_msleep(1);
    // }

    // ReSYNC();
    while (trial_start && current_conn){
        k_sem_give(&camera_thread_semaphore);
        k_msleep(50);
    }
    
    ///////////////////// after loop

    nrf_i2s_int_disable(NRF_I2S0, NRF_I2S_INT_RXPTRUPD_MASK |
                                  NRF_I2S_INT_TXPTRUPD_MASK);
    nrfx_i2s_uninit();
    k_thread_abort(camera_thread_tid);
    k_thread_abort(ICM_thread_tid);
    k_thread_abort(H_ICM_thread_tid);
    k_thread_abort(processing_thread_tid);
    

    NRFX_IRQ_DISABLE(GPIOTE0_IRQn);
    NVIC_DisableIRQ(GPIOTE0_IRQn);
    irq_disable(GPIOTE0_IRQn);

    NRF_GPIOTE->INTENCLR |= 0x00000080;
    nrf_gpiote_event_disable(NRF_GPIOTE0, 7);
    NRF_GPIOTE->INTENCLR |= 0x00000040;
    nrf_gpiote_event_disable(NRF_GPIOTE0, 6);

    

    k_msleep(1000);

	printk("Stream stopped\n");

	printk("File named in trial %02d successfully created\n", trial_count);		
	fs_close(&mic_file);
    fs_close(&imu_file);
    fs_close(&H_imu_file);
    fs_close(&video_file);
    // fs_close(&imu_count_file);

    k_msleep(1000);
    lsdir(disk_mount_pt);
    k_msleep(1000);

    // bt_le_adv_stop();

    trial_count = trial_count + 1;
}

printk("Bluetooth disconnected...Stop all\n");
return 0;
}
